www/lrn/lisp/lisp-4.html
<!DOCTYPE html>
<html>
<head>
<title></title>
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">План работ</a></li>
<li><a href="#unnumbered-2">Lookup в глобальном окружении</a></li>
<li><a href="#unnumbered-3">Функции для тестирования</a></li>
<li><a href="#unnumbered-4">Структура замыкания</a></li>
<li><a href="#unnumbered-5">MyApply</a>
<ul>
<li><a href="#unnumbered-6">Работа с CONS-ячейками</a></li>
<li><a href="#unnumbered-7">NULL-предикат</a></li>
<li><a href="#unnumbered-8">Встроенные функции арифметики</a></li>
<li><a href="#unnumbered-9">CLOSURE</a></li>
<li><a href="#unnumbered-10">PRINT</a></li>
</ul>
</li>
<li><a href="#unnumbered-11">MyEval</a>
<ul>
<li><a href="#unnumbered-12">Преобразование EVLIS</a>
<ul>
<li><a href="#unnumbered-13">Преобразование факториала</a></li>
<li><a href="#unnumbered-14">Преобразование фибоначчи</a></li>
<li><a href="#unnumbered-15">Преобразование функции обработки списка</a></li>
<li><a href="#unnumbered-16">Преобразование EVLIS и MYEVAL</a></li>
</ul>
</li>
<li><a href="#unnumbered-17">Самовычисляемые формы</a></li>
<li><a href="#unnumbered-18">Вычисление символов</a></li>
<li><a href="#unnumbered-19">Цитирование</a></li>
<li><a href="#unnumbered-20">Условное выполнение IF</a></li>
<li><a href="#unnumbered-21">COND</a></li>
<li><a href="#unnumbered-22">PROGN</a></li>
<li><a href="#unnumbered-23"><span class="done nilCANCEL">CANCEL</span> PRINT</a></li>
<li><a href="#unnumbered-24"><span class="todo nilTODO">TODO</span> LIST</a></li>
<li><a href="#unnumbered-25">AND</a></li>
<li><a href="#unnumbered-26">OR</a></li>
<li><a href="#unnumbered-27">LET</a></li>
<li><a href="#unnumbered-28">LET*</a></li>
<li><a href="#unnumbered-29">DEFUN</a></li>
<li><a href="#unnumbered-30"><span class="todo nilTODO">TODO</span> SETQ</a></li>
<li><a href="#unnumbered-31">LAMBDA</a></li>
</ul>
</li>
<li><a href="#unnumbered-32">Итоги</a></li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">План работ</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
Цель этого этапа: преобразовать наш интерпретатор так, чтобы он был написан в стиле
передачи продолжений (сontinuation-passing style, CPS).
</p>

<p>
Зачем мы это делаем? Сейчас мы имеем рекурсивный интерпретатор, который использует
рекурсию, когда выполняет оценку (<code>eval</code>) программмы. Нам надо получить нерекурсивный
(итеративный, циклический) интерпретатор, иначе:
</p>
<ul class="org-ul">
<li>нам придется пользоваться стеком хост-языка, чтобы обрабатывать рекурсивный <code>eval</code>
</li>
<li>мы не сможем написать отладчик с точками останова, шагом исполнения и.т.п. потому что
рекурсивный интерпретатор нельзя остановить в определенный момент.
</li>
<li>мы не сможем сделать механизм обработки ошибок, такой как catch/trow и сложные
структуры управления потоком управления.
</li>
</ul>

<p>
Поэтому нам надо удалить рекурсию из интерпретатора. Есть два способа подойти к этой
проблеме:
</p>
<ul class="org-ul">
<li>CPS-преобразование
</li>
<li>Реализация SECD-машины
</li>
</ul>

<p>
SECD-машину мы будем реализовывать несколько позже, а сейчас сосредоточимся на
CPS-преобразовании. Оно дает нам бесплатные бонусы, например:
</p>
<ul class="org-ul">
<li>решение semipredicate problem, проблемы полупредикатов.
</li>
</ul>

<p>
Полупредикаты - это предикаты, у которых может быть три возможных вида возвращаемых
значений:
</p>
<ul class="org-ul">
<li>T
</li>
<li>NIL
</li>
<li>Еще один вид, например "элемент не найден"
</li>
</ul>

<p>
Например, полупредикатом является <code>assoc</code>. Вот его реализация, которая названа
<code>assoc-1</code>, чтобы не перекрывать встроенную функцию:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">assoc-1</span> (key alist)
  (<span style="color: #af00ff;">cond</span> ((null alist) nil)
        ((equal key (caar alist)) (car alist))
        (t (assoc-1 key (cdr alist)))))

<span style="color: #af0000;">;; </span><span style="color: #af0000;">(assoc-1 'alfa '((alfa . 1) (beta . 2)))</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">=&gt; (ALFA . 1)</span>

<span style="color: #af0000;">;; </span><span style="color: #af0000;">(assoc-1 'gamma '((alfa . 1) (beta . 2)))</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">=&gt; NIL</span>
</pre>
</div>

<p>
В этой реализации <code>assoc-1</code> вынужден возвращать точечную пару <code>(имя . значение)</code>, ведь
иначе будет невозможно отличить ситуацию "элемент не найден" от ситуации "элемент имеет
значение NIL".
</p>

<p>
Типичным вариантом использования является проверка на "элемент не найден" возвращаемого
<code>assoc</code> значения. Ее отсутствие, как правило является ошибкой. Так как после решения
funarg-problem мы можем передавать функции, мы могли бы сделать такой вариант <code>assoc</code>,
который принимал бы функцию, которая будет вызвана в ситуации "элемент не найден".
</p>

<p>
Такая функция называется "продолжением". Следуя далее этим путем, мы могли бы
передавать два продолжения: одно будет вызвано, если элемент не найден, а второе - в
противном случае:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="assoc_4">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">assoc-2</span> (key alist cont errcont) <span style="color: #af0000;">;; </span><span style="color: #af0000;">NB!: inverted order of</span>
                                        <span style="color: #af0000;">;; </span><span style="color: #af0000;">continuations (for lookup)</span>
  (<span style="color: #af00ff;">cond</span> ((null alist)              (funcall errcont key))
        ((equal key (caar alist))  (funcall cont    (cdar alist)))
        (t                         (assoc-2 key (cdr alist) cont errcont))))
</pre>
</div>

<p>
Мы можем протестировать это в обоих случаях:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="assoc_4_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"ok:123"</span>
               (assoc-2 'alfa '((alfa . 123))
                        (<span style="color: #af00ff;">lambda</span> (x) (format nil <span style="color: #87005f;">"ok:~A"</span> x))
                        (<span style="color: #af00ff;">lambda</span> (x) (format nil <span style="color: #87005f;">"err:~A"</span> x)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"err:ALFA"</span>
               (assoc-2 'alfa '((beta . 123))
                        (<span style="color: #af00ff;">lambda</span> (x) (format nil <span style="color: #87005f;">"ok:~A"</span> x))
                        (<span style="color: #af00ff;">lambda</span> (x) (format nil <span style="color: #87005f;">"err:~A"</span> x)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">Lookup в глобальном окружении</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<p>
Используя такой подход мы можем изменить <code>lookup</code>, который у нас выглядел так:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="lookup_3_old">(<span style="color: #af00ff;">defparameter</span> <span style="color: #af5f00;">*glob-env*</span> nil)
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">lookup</span> (symb env)
  (<span style="color: #af00ff;">let</span> ((it (assoc symb env)))
    (<span style="color: #af00ff;">if</span> (not (null it))
        it
        (assoc symb *glob-env*))))
</pre>
</div>

<p>
Теперь <code>lookup</code> будет написан в стиле передачи продолжений:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="lookup_4"><span style="color: #af0000;">;; </span><span style="color: #af0000;">environment</span>
(<span style="color: #af00ff;">defparameter</span> <span style="color: #af5f00;">*glob-env*</span> nil)
<span style="color: #af0000;">;; </span><span style="color: #af0000;">lookup</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">lookup</span> (symb env errcont cont)
  (assoc-2 symb env cont
           (<span style="color: #af00ff;">lambda</span> (key)
             (assoc-2 key *glob-env* cont
                      (<span style="color: #af00ff;">lambda</span> (key)
                        (funcall errcont
                                 (format
                                  nil
                                  <span style="color: #87005f;">"UNBOUD VARIABLE [~A] ~%LOCAL ENV: [~A] ~%GLOBAL ENV: [~A]"</span>
                                  key env *glob-env*)))))))
</pre>
</div>

<p>
Теперь <code>lookup</code> принимает два продолжения:
</p>
<ul class="org-ul">
<li>продолжение <code>errcont</code> вызывается в случае, если элемент не найден, ему передается
ошибка в качестве параметра
</li>
<li>продолжение <code>cont</code> вызывается, когда элемент найден, ему передается найденное
значение в качестве параметра.
</li>
</ul>

<p>
Мы можем протестировать его:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="lookup_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">test lookup</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"ok:123"</span> (lookup 'aaa '((aaa . 123))
                                (<span style="color: #af00ff;">lambda</span> (x) (format nil <span style="color: #87005f;">"err:~A"</span> x))
                                (<span style="color: #af00ff;">lambda</span> (x) (format nil <span style="color: #87005f;">"ok:~A"</span> x)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal nil      (lookup 'aaa '((bbb . 123))
                                (<span style="color: #af00ff;">lambda</span> (x) (<span style="color: #af00ff;">declare</span> (ignore x)) nil)
                                (<span style="color: #af00ff;">lambda</span> (x) (format nil <span style="color: #87005f;">"ok:~A"</span> x)))))
</pre>
</div>

<p>
Но для того того чтобы в конце концов получить вывод значения на экран нам
понадобятся&#x2026;
</p>
</div>
</div>
