org/lrn/lisp/lisp-4.org
* Функции для тестирования

Чтобы удобнее тестироть функции, написанные в стиле передачи продолжений нам стоит
иметь две функции-продолжения, которые будут выводить тестируемы результат:

#+NAME: ok_err_4
#+BEGIN_SRC lisp
  (defun ok (x)
    (format t "~%ok: ~A" x)
    x)

  (defun err (x)
    (format t "~%err: ~A" x)
    x)
#+END_SRC

Мы будем передавать из как ~cont~ и ~errcont~.

* Структура замыкания

Чтобы сделать лексическое окружение, нужно иметь структуру замыкания, тут ничего не
изменилось, мы все так же создаем структуру для замыкания:

#+NAME: closure_4
#+BEGIN_SRC lisp
  (defstruct closure
    body
    env
    args)
#+END_SRC

* MyApply

Теперь ~myapply~ принимает два продолжения: ~errcont~ и ~cont~.

Переносим сюда ~print~ и ~list~ из ~myeval~, потому что это функции, которые оценивает
свои аргументы.

#+NAME: myapply_4
#+BEGIN_SRC lisp
  <<evaddmul_4>>
  (defun myapply (fn args errcont cont)
    (cond
      <<myapply_car_cdr_cons_4>>
      <<myapply_null_4>>
      <<myapply_ariph_4>>
      <<myapply_closure_4>>
      <<myapply_print_4>>
      ))
#+END_SRC

А набор тестов остался без изменений:

#+NAME: myapply_4_test
#+BEGIN_SRC lisp
  <<myapply_car_cdr_cons_4_test>>
  <<myapply_null_4_test>>
  <<evaddmul_4_test>>
  <<myapply_ariph_4_test>>
  <<myapply_print_4_test>>
  <<myapply_closure_4_test>>
#+END_SRC

** Работа с CONS-ячейками

Функции, которые работают с cons-ячейками теперь вызывают продолжение ~cont~, передавая
ему в качестве параметра результат своих вычислений.

#+NAME: myapply_car_cdr_cons_4
#+BEGIN_SRC lisp
  ((equal fn 'car)             (funcall cont (caar args)))
  ((equal fn 'cdr)             (funcall cont (cdar args)))
  ((equal fn 'cons)            (funcall cont (cons (car args) (cadr args))))
#+END_SRC

Тесты такие-же, но теперь принимают продолжения

#+NAME: myapply_car_cdr_cons_4_test
#+BEGIN_SRC lisp
  ;; Тесты cons, car, cdr
  (assert (equal '(1 . 2) (myeval '(cons 1 2) nil #'err #'ok)))
  (assert (equal '((1 . 2) 3 . 4) (myeval '(cons (cons 1 2) (cons 3 4)) nil #'err #'ok)))
  (assert (equal 2 (myeval '(car (cons 2 3)) nil #'err #'ok)))
  (assert (equal 3 (myeval '(cdr (cons 2 3)) nil #'err #'ok)))
  (assert (equal '(1 . 2) (myeval '(car (cons (cons 1 2) (cons 3 4))) nil #'err #'ok)))
  (assert (equal '(3 . 4) (myeval '(cdr (cons (cons 1 2) (cons 3 4))) nil #'err #'ok)))
  ;; Тесты для cons-ячеек, вычисляемых в окружении
  (assert (equal 1 (myeval '(car a) '((a . (1 . 2))) #'err #'ok)))
  (assert (equal 2 (myeval '(cdr a) '((a . (1 . 2))) #'err #'ok)))
  (assert (equal 3 (myeval '(car b) '((a . (1 . 2)) (b . (3 . 4))) #'err #'ok)))
#+END_SRC

** NULL-предикат

#+NAME: errors_4
#+BEGIN_SRC lisp
  (define-condition invalid-number-of-arguments (error)
    ((fn :initarg :fn  :reader fn))
    (:report
     (lambda (condition stream)
       (format stream "Error in MYAPPLY: invalid-number-of-arguments: ~A"
               (fn condition)))))
#+END_SRC

~null~ теперь тоже вызывает продолжение ~cont~:

#+NAME: myapply_null_4
#+BEGIN_SRC lisp
  ((equal fn 'null)            (if (null (cdr args))
                                   (funcall cont (null (car args)))
                                   (error 'invalid-number-of-arguments :fn fn)))
#+END_SRC

Тесты такие-же, но теперь принимают продолжения

#+NAME: myapply_null_4_test
#+BEGIN_SRC lisp
  ;; Тесты для NULL
  (assert (equal T (myeval '(null ()) nil #'err #'ok)))
  (assert (equal T (myeval '(null nil) nil #'err #'ok)))
  (assert (equal NIL (myeval '(null T) nil #'err #'ok)))
  (assert (equal T (myeval '(null a) '((a . ())) #'err #'ok)))
  ;; Тесты для NULL, с аргументом, вычисляемые в окружении
  (assert (equal NIL (myeval '(null a) '((a . T)) #'err #'ok)))
  (assert (equal NIL (myeval '(null a) '((a . 1)) #'err #'ok)))
#+END_SRC

