www/lrn/lisp/lisp-4.html

<div id="outline-container-unnumbered-3" class="outline-2">
<h2 id="unnumbered-3">Функции для тестирования</h2>
<div class="outline-text-2" id="text-unnumbered-3">
<p>
Чтобы удобнее тестироть функции, написанные в стиле передачи продолжений нам стоит
иметь две функции-продолжения, которые будут выводить тестируемый результат:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="ok_err_4">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">ok</span> (x)
  (format t <span style="color: #87005f;">"~%ok: ~A"</span> x)
  x)
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">err</span> (x)
  (format t <span style="color: #87005f;">"~%err: ~A"</span> x)
  x)
</pre>
</div>

<p>
Мы будем передавать их как <code>cont</code> и <code>errcont</code>.
</p>
</div>
</div>

<div id="outline-container-unnumbered-4" class="outline-2">
<h2 id="unnumbered-4">Структура замыкания</h2>
<div class="outline-text-2" id="text-unnumbered-4">
<p>
Чтобы сделать лексическое окружение, нужно иметь структуру замыкания, тут ничего не
изменилось, мы все так же создаем структуру для замыкания:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="closure_4">(<span style="color: #af00ff;">defstruct</span> <span style="color: #008700;">closure</span>
  body
  env
  args)
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-5" class="outline-2">
<h2 id="unnumbered-5">MyApply</h2>
<div class="outline-text-2" id="text-unnumbered-5">
<p>
Теперь <code>myapply</code> принимает два продолжения: <code>errcont</code> и <code>cont</code>.
</p>

<p>
Переносим сюда <code>print</code> из <code>myeval</code>, потому что это функция, которая оценивает свои
аргументы.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_4">&lt;&lt;evaddmul_4&gt;&gt;
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">myapply</span> (fn args errcont cont)
  (<span style="color: #af00ff;">cond</span>
    &lt;&lt;myapply_car_cdr_cons_4&gt;&gt;
    &lt;&lt;myapply_null_4&gt;&gt;
    &lt;&lt;myapply_ariph_4&gt;&gt;
    &lt;&lt;myapply_closure_4&gt;&gt;
    &lt;&lt;myapply_print_4&gt;&gt;
    ))
</pre>
</div>

<p>
А набор тестов остался без изменений:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_4_test">&lt;&lt;myapply_car_cdr_cons_4_test&gt;&gt;
&lt;&lt;myapply_null_4_test&gt;&gt;
&lt;&lt;evaddmul_4_test&gt;&gt;
&lt;&lt;myapply_ariph_4_test&gt;&gt;
&lt;&lt;myapply_print_4_test&gt;&gt;
&lt;&lt;myapply_closure_4_test&gt;&gt;
</pre>
</div>
</div>

<div id="outline-container-unnumbered-6" class="outline-3">
<h3 id="unnumbered-6">Работа с CONS-ячейками</h3>
<div class="outline-text-3" id="text-unnumbered-6">
<p>
Функции, которые работают с cons-ячейками теперь вызывают продолжение <code>cont</code>, передавая
ему в качестве параметра результат своих вычислений.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_car_cdr_cons_4">((equal fn 'car)             (funcall cont (caar args)))
((equal fn 'cdr)             (funcall cont (cdar args)))
((equal fn 'cons)            (funcall cont (cons (car args) (cadr args))))
</pre>
</div>

<p>
Тесты такие-же, но теперь принимают продолжения
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_car_cdr_cons_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; cons, car, cdr</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 2) (myeval '(cons 1 2) nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '((1 . 2) 3 . 4) (myeval '(cons (cons 1 2) (cons 3 4)) nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(car (cons 2 3)) nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(cdr (cons 2 3)) nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 2) (myeval '(car (cons (cons 1 2) (cons 3 4))) nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 . 4) (myeval '(cdr (cons (cons 1 2) (cons 3 4))) nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; cons-&#1103;&#1095;&#1077;&#1077;&#1082;, &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(car a) '((a . (1 . 2))) #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(cdr a) '((a . (1 . 2))) #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(car b) '((a . (1 . 2)) (b . (3 . 4))) #'err #'ok)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-7" class="outline-3">
<h3 id="unnumbered-7">NULL-предикат</h3>
<div class="outline-text-3" id="text-unnumbered-7">
<div class="org-src-container">

<pre class="src src-lisp" id="errors_4">(<span style="color: #af00ff;">define-condition</span> <span style="color: #0000ff;">invalid-number-of-arguments</span> (<span style="color: #ff0000; font-weight: bold;">error</span>)
  ((fn <span style="color: #5f5f87;">:initarg</span> <span style="color: #5f5f87;">:fn</span>  <span style="color: #5f5f87;">:reader</span> fn))
  (<span style="color: #5f5f87;">:report</span>
   (<span style="color: #af00ff;">lambda</span> (condition stream)
     (format stream <span style="color: #87005f;">"Error in MYAPPLY: invalid-number-of-arguments: ~A"</span>
             (fn condition)))))
</pre>
</div>

<p>
<code>null</code> теперь тоже вызывает продолжение <code>cont</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_null_4">((equal fn 'null)            (<span style="color: #af00ff;">if</span> (null (cdr args))
                                 (funcall cont (null (car args)))
                                 (<span style="color: #ff0000; font-weight: bold;">error</span> 'invalid-number-of-arguments <span style="color: #5f5f87;">:fn</span> fn)))
</pre>
</div>

<p>
Тесты такие-же, но теперь принимают продолжения
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_null_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; NULL</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal T (myeval '(null ()) nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal T (myeval '(null nil) nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal NIL (myeval '(null T) nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal T (myeval '(null a) '((a . ())) #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; NULL, &#1089; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084;, &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1084;&#1099;&#1077; &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal NIL (myeval '(null a) '((a . T)) #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal NIL (myeval '(null a) '((a . 1)) #'err #'ok)))
</pre>
</div>
</div>
</div>
