org/lrn/lisp/lisp-4.org
** PRINT

PRINT - это функция, т.к. она оценивает свои аргументы. Перенесем ~print~ из ~myeval~ в
~myapply~ и научим его принимать продолжения:

#+NAME: myapply_print_4
#+BEGIN_SRC lisp
  ((equal fn 'print)           (funcall cont (print (car args))))
#+END_SRC

Тесты такие-же, но теперь принимают продолжения

#+NAME: myapply_print_4_test
#+BEGIN_SRC lisp
  ;; Тесты для PRINT в сравнении с host-овым print
  (assert (equal (with-output-to-string (*standard-output*)
                   (print 12))
                 (with-output-to-string (*standard-output*)
                   (myeval '(print 12) nil #'err #'identity))))
  (assert (equal (print 12)
                 (myeval '(print 12) nil #'err #'ok)))
  ;; Тесты для PRINT в окружении
  (assert (equal (with-output-to-string (*standard-output*)
                   (let ((a 12))
                     (print a)))
                 (with-output-to-string (*standard-output*)
                   (myeval '(print a)
                           '((b . 23) (a . 12))
                           #'err #'identity))))
  (assert (equal (let ((a 12))
                   (print a))
                 (myeval '(print a)
                         '((b . 23) (a . 12))
                         #'err #'ok)))
#+END_SRC

* MyEval

Теперь ~myeval~ принимает два продолжения: ~errcont~ и ~cont~ и передает их при
рекурсивном вызове внутри лямбды. Мы также переименовываем параметр ~lst~ в ~exp~.

Это еще не все изменения. Изменяется хвостовая часть ~myeval~, что будет подробно
описано в следующем подразделе [[*Преобразование EVLIS и MYEVAL][Преобразование EVLIS и MYEVAL]]

#+NAME: myeval_4
#+BEGIN_SRC lisp
  <<myeval_evcond_4>>
  <<myeval_evprogn_4>>
  <<myeval_evlis_4>>
  <<myeval_evand_4>>
  <<myeval_evor_4>>
  <<myeval_mypairlis_4>>
  <<myeval_evlet_4>>
  <<myeval_evletstar_4>>

  (defun myeval (exp env errcont cont)
    (cond
      <<myeval_number_4>>
      <<myeval_symb_4>>
      <<myeval_quote_4>>
      <<myeval_if_4>>
      <<myeval_cond_4>>
      <<myeval_progn_4>>
      ;; Тут был PRINT, но он перенесен в MYAPPLY
      <<myeval_list_4>>
      <<myeval_and_4>>
      <<myeval_or_4>>
      <<myeval_let_4>>
      <<myeval_letstar_4>>
      <<myeval_defun_4>>
      <<myeval_setq_4>>
      <<myeval_lambda_4>>
      (t
       (myeval (car exp) env errcont
               (lambda (x)
                 (evlis  x  (cdr exp) nil env errcont cont))))))
#+END_SRC

Тесты:

#+NAME: myeval_4_test
#+BEGIN_SRC lisp
  <<myeval_number_4_test>>
  <<myeval_symb_4_test>>
  <<myeval_quote_4_test>>
  <<myeval_if_4_test>>
   <<myeval_evcond_4_test>>
  <<myeval_cond_4_test>>
    <<myeval_evprogn_3_test>>
  <<myeval_progn_4_test>>
    <<myeval_print_4_test>>
  <<myeval_evlis_4_test>>
  <<myeval_list_4_test>>
    <<myeval_evand_4_test>>
    <<myeval_and_4_test>>
    <<myeval_evor_4_test>>
    <<myeval_or_4_test>>
  <<myeval_mypairlis_4_test>>
  <<myeval_evlet_4_test>>
  <<myeval_let_4_test>>
  <<myeval_evletstar_4_test>>
  <<myeval_letstar_4_test>>
  <<myeval_defun_4_test>>
  <<myeval_setq_4_test>>
  ;; lambda?
#+END_SRC

** Преобразование EVLIS

Напомним, что EVLIS - это функция, которая оценивает аргументы перед применением
(MYAPPLY). Мы хотим преобразовать ее к CPS-виду. Нам потребуется несколько этапов,
чтобы понять и реализовать это.
- Преобразование в CPS на примере факториала (через рекурсию с аккумулятором)
- Преобразование на примере фибоначчи
- Преобразование функции обработки списка
- Преобразование EVLIS

