www/lrn/lisp/lisp-4.html

<div id="outline-container-unnumbered-10" class="outline-3">
<h3 id="unnumbered-10">PRINT</h3>
<div class="outline-text-3" id="text-unnumbered-10">
<p>
PRINT - это функция, т.к. она оценивает свои аргументы. Перенесем <code>print</code> из <code>myeval</code> в
<code>myapply</code> и научим его принимать продолжения:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_print_4">((equal fn 'print)           (funcall cont (print (car args))))
</pre>
</div>

<p>
Тесты такие-же, но теперь принимают продолжения
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_print_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; PRINT &#1074; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1080; &#1089; host-&#1086;&#1074;&#1099;&#1084; print</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">with-output-to-string</span> (*standard-output*)
                 (print 12))
               (<span style="color: #af00ff;">with-output-to-string</span> (*standard-output*)
                 (myeval '(print 12) nil #'err #'identity))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (print 12)
               (myeval '(print 12) nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; PRINT &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">with-output-to-string</span> (*standard-output*)
                 (<span style="color: #af00ff;">let</span> ((a 12))
                   (print a)))
               (<span style="color: #af00ff;">with-output-to-string</span> (*standard-output*)
                 (myeval '(print a)
                         '((b . 23) (a . 12))
                         #'err #'identity))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 12))
                 (print a))
               (myeval '(print a)
                       '((b . 23) (a . 12))
                       #'err #'ok)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-unnumbered-11" class="outline-2">
<h2 id="unnumbered-11">MyEval</h2>
<div class="outline-text-2" id="text-unnumbered-11">
<p>
Теперь <code>myeval</code> принимает два продолжения: <code>errcont</code> и <code>cont</code> и передает их при
рекурсивном вызове внутри лямбды. Мы также переименовываем параметр <code>lst</code> в <code>exp</code>.
</p>

<p>
Это еще не все изменения. Изменяется хвостовая часть <code>myeval</code>, что будет подробно
описано в следующем подразделе <a href="#unnumbered-16">Преобразование EVLIS и MYEVAL</a>
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_4">&lt;&lt;myeval_evcond_4&gt;&gt;
&lt;&lt;myeval_evprogn_4&gt;&gt;
&lt;&lt;myeval_evlis_4&gt;&gt;
&lt;&lt;myeval_evand_4&gt;&gt;
&lt;&lt;myeval_evor_4&gt;&gt;
&lt;&lt;myeval_mypairlis_4&gt;&gt;
&lt;&lt;myeval_evlet_4&gt;&gt;
&lt;&lt;myeval_evletstar_4&gt;&gt;
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">myeval</span> (exp env errcont cont)
  (<span style="color: #af00ff;">cond</span>
    &lt;&lt;myeval_number_4&gt;&gt;
    &lt;&lt;myeval_symb_4&gt;&gt;
    &lt;&lt;myeval_quote_4&gt;&gt;
    &lt;&lt;myeval_if_4&gt;&gt;
    &lt;&lt;myeval_cond_4&gt;&gt;
    &lt;&lt;myeval_progn_4&gt;&gt;
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1091;&#1090; &#1073;&#1099;&#1083; PRINT, &#1085;&#1086; &#1086;&#1085; &#1087;&#1077;&#1088;&#1077;&#1085;&#1077;&#1089;&#1077;&#1085; &#1074; MYAPPLY</span>
    &lt;&lt;myeval_list_4&gt;&gt;
    &lt;&lt;myeval_and_4&gt;&gt;
    &lt;&lt;myeval_or_4&gt;&gt;
    &lt;&lt;myeval_let_4&gt;&gt;
    &lt;&lt;myeval_letstar_4&gt;&gt;
    &lt;&lt;myeval_defun_4&gt;&gt;
    &lt;&lt;myeval_setq_4&gt;&gt;
    &lt;&lt;myeval_lambda_4&gt;&gt;
    (t
     (myeval (car exp) env errcont
             (<span style="color: #af00ff;">lambda</span> (x)
               (evlis  x  (cdr exp) nil env errcont cont))))))
</pre>
</div>

<p>
Тесты:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_4_test">&lt;&lt;myeval_number_4_test&gt;&gt;
&lt;&lt;myeval_symb_4_test&gt;&gt;
&lt;&lt;myeval_quote_4_test&gt;&gt;
&lt;&lt;myeval_if_4_test&gt;&gt;
&lt;&lt;myeval_evcond_4_test&gt;&gt;
&lt;&lt;myeval_cond_4_test&gt;&gt;
&lt;&lt;myeval_evprogn_4_test&gt;&gt;
&lt;&lt;myeval_progn_4_test&gt;&gt;
&lt;&lt;myeval_evlis_4_test&gt;&gt;
&lt;&lt;myeval_list_4_test&gt;&gt;
&lt;&lt;myeval_evand_4_test&gt;&gt;
&lt;&lt;myeval_and_4_test&gt;&gt;
&lt;&lt;myeval_evor_4_test&gt;&gt;
&lt;&lt;myeval_or_4_test&gt;&gt;
&lt;&lt;myeval_mypairlis_4_test&gt;&gt;
&lt;&lt;myeval_evlet_4_test&gt;&gt;
&lt;&lt;myeval_let_4_test&gt;&gt;
&lt;&lt;myeval_evletstar_4_test&gt;&gt;
&lt;&lt;myeval_letstar_4_test&gt;&gt;
&lt;&lt;myeval_defun_4_test&gt;&gt;
&lt;&lt;myeval_setq_4_test&gt;&gt;
&lt;&lt;myeval_lambda_4_test&gt;&gt;
</pre>
</div>
</div>

<div id="outline-container-unnumbered-12" class="outline-3">
<h3 id="unnumbered-12">Преобразование EVLIS</h3>
<div class="outline-text-3" id="text-unnumbered-12">
<p>
Напомним, что EVLIS - это функция, которая оценивает аргументы перед применением
(MYAPPLY). Мы хотим преобразовать ее к CPS-виду. Нам потребуется несколько этапов,
чтобы понять и реализовать это.
</p>
<ul class="org-ul">
<li>Преобразование в CPS на примере факториала (через рекурсию с аккумулятором)
</li>
<li>Преобразование на примере фибоначчи
</li>
<li>Преобразование функции обработки списка
</li>
<li>Преобразование EVLIS
</li>
</ul>
</div>
