org/lrn/lisp/lisp-4.org
*** Преобразование факториала

В качестве примера возьмем факториал:

#+BEGIN_SRC lisp
  (defun fact (n)
    (cond ((equal 0 n)  1)
          (t            (* n (fact (- n 1))))))
#+END_SRC

Этот факториал не хвосторекурсивный, потому что последним выполненным вызовом будет
умножение. Если бы последний вызов было бы ~fact~, то мы могли бы использовать
оптимизацию хвостовой рекурсии, что само по позволяет сделать более эффективный код.

Мы можем использовать параметр-аккумулятор, чтобы преобразовать нехвостовую рекурсию в
хвостовую. Этот аккумулятор будет накапливать результат вычисления, который ранее был в
возвращаемом значении. Тогда нам уже не нужно использовать возвращаемое значение при
шаге вычисления и мы можем сделать рекурсию хвостовой.

Тогда наш факториал будет таким:

#+BEGIN_SRC lisp
  (defun fact-tail-call (n &optional (acc 1))
    (cond ((equal 0 n)  acc)
          (t            (fact-tail-call (- n 1)
                                        (* n acc)))))
#+END_SRC

Таким образом возвращаемое значение не является для нас важным до тех пор, пока мы не
достигнем базы рекурсии, т.е. пока ~n~ не станет равным нулю. Тут мы просто возвратим
значение аккумулятора.

Технически, мы можем построить эквивалентный цикл для этого кода:

#+BEGIN_SRC lisp
  (defun fact-iter (param)
    (let ((acc 1))
      (loop :for n :from param :downto 1 :do
         (setf acc (* n acc))
         (print acc))
      acc))
#+END_SRC

[TODO:gmm] - как сделать это полностью автоматически. Нужен будет code walker?

Теперь перепишем хвосторекурсивный факториал в cps-стиле. Чтобы преобразовать
~fact-tail-call~ в ~fact-tail-call-cps~ добавим параметр-продолжение ~cont~, в который
будем передавать функцию, которая представляет собой остаток вычисления. ~(- n 1)~ мы
можем вычислить сразу, а ~(* n acc)~ - нет, так как у нас больше нет параметра
~acc~.

#+BEGIN_SRC lisp
  (defun fact-tail-call-cps (n cont)
    (cond ((equal n 1)  (funcall cont 1))
          (t            (fact-tail-call-cps (- n 1)
                                            (lambda (x)
                                              (funcall cont (* n x)))))))
  (defun fact-tail-call-cps-start (n)
    (fact-tail-call-cps n (lambda (x) x)))
#+END_SRC

Здесь вместо аккумулятора мы передаем продолжение. Это продолжение представлят собой
лямбду, которая вызывает продолжение-параметр. Это продолжение-параметр вызывается с
аргументом, который представляет собой собственно вычисление (n * x). По-видимому, это
такой довольно интересный способ отложить вычисления до тех пор пока мы не достигнем
базы рекурсии.

В самом деле, при вызове ~(fact-tail-call-cps 3 #'(lambda (x) x))~, когда мы достигнем
базы рекурсии будет выполнено это:

#+BEGIN_SRC lisp
  (funcall (lambda (x)
             (funcall (lambda (x)
                        (funcall (lambda (x)
                                   x)
                                 (* 3 x)))
                      (* 2 x)))
           1)
#+END_SRC

*** Преобразование фибоначчи

Второй пример будет чуть сложнее - числа фибоначчи:

#+BEGIN_SRC lisp
  (defun fib (n)
    (cond ((equal n 1)  1)
          ((equal n 2)  1)
          (t            (+ (fib (- n 1))
                           (fib (- n 2))))))
#+END_SRC

Преобразуем вызов в хвосторекурсивный, используя аккумуляторы. С помощью них мы можем
уменьшить количество вложенных вызовов, если применим такую стратегию вычилений:

В первом параметре ~n~ будем декрементировать шаг вычисления, в последнем параметре на
каждом шаге будем передавать сумму аккумуляторов, а в предпоследнем - предыдущее
значение суммы.

Таким образом в последнем параметре при каждом вызове начнет накапливаться
последовательность сумм, а в предпоследнем - так же последовательность сумм, но со
сдвигом на шаг назад.

Когда счетчик ~n~ достаточно уменьшится мы сможем просто возвратить последний
параметр. Таким образом время вычисления из экспоненциального превращается в линейное.

#+BEGIN_SRC lisp
  (defun ftc (n &optional (acc1 1) (acc2 1))
    (cond ((or (equal 1 n)
               (equal 2 n))  acc2)
          (t                 (ftc (- n 1) acc2 (+ acc1 acc2)))))
#+END_SRC

Теперь перепишем в cps-стиле:

#+BEGIN_SRC lisp
  (defun ftc-cps (n cont)
    (cond ((equal 1 n)  (funcall cont 1 1))
          ((equal 2 n)  (funcall cont 1 1))
          (t            (ftc-cps (- n 1)
                                 (lambda (acc1 acc2)
                                   (funcall cont acc2 (+ acc1 acc2)))))))

  (defun ftc-cps-start (n)
    (ftc-cps n (lambda (acc1 acc2)
                 acc2)))
#+END_SRC

[TODO:gmm] - Здесь надо для тренировки превратить это в CPS.

