www/lrn/lisp/lisp-4.html

<div id="outline-container-unnumbered-13" class="outline-4">
<h4 id="unnumbered-13">Преобразование факториала</h4>
<div class="outline-text-4" id="text-unnumbered-13">
<p>
В качестве примера возьмем факториал:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">fact</span> (n)
  (<span style="color: #af00ff;">cond</span> ((equal 0 n)  1)
        (t            (* n (fact (- n 1))))))
</pre>
</div>

<p>
Этот факториал не хвосторекурсивный, потому что последним выполненным вызовом будет
умножение. Если бы последний вызов было бы <code>fact</code>, то мы могли бы использовать
оптимизацию хвостовой рекурсии, что само по позволяет сделать более эффективный код.
</p>

<p>
Мы можем использовать параметр-аккумулятор, чтобы преобразовать нехвостовую рекурсию в
хвостовую. Этот аккумулятор будет накапливать результат вычисления, который ранее был в
возвращаемом значении. Тогда нам уже не нужно использовать возвращаемое значение при
шаге вычисления и мы можем сделать рекурсию хвостовой.
</p>

<p>
Тогда наш факториал будет таким:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">fact-tail-call</span> (n <span style="color: #008700;">&amp;optional</span> (acc 1))
  (<span style="color: #af00ff;">cond</span> ((equal 0 n)  acc)
        (t            (fact-tail-call (- n 1)
                                      (* n acc)))))
</pre>
</div>

<p>
Таким образом возвращаемое значение не является для нас важным до тех пор, пока мы не
достигнем базы рекурсии, т.е. пока <code>n</code> не станет равным нулю. Тут мы просто возвратим
значение аккумулятора.
</p>

<p>
Технически, мы можем построить эквивалентный цикл для этого кода:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">fact-iter</span> (param)
  (<span style="color: #af00ff;">let</span> ((acc 1))
    (<span style="color: #af00ff;">loop</span> <span style="color: #5f5f87;">:for</span> n <span style="color: #5f5f87;">:from</span> param <span style="color: #5f5f87;">:downto</span> 1 <span style="color: #5f5f87;">:do</span>
       (setf acc (* n acc))
       (print acc))
    acc))
</pre>
</div>

<p>
Теперь перепишем хвосторекурсивный факториал в cps-стиле. Чтобы преобразовать
<code>fact-tail-call</code> в <code>fact-tail-call-cps</code> добавим параметр-продолжение <code>cont</code>, в который
будем передавать функцию, которая представляет собой остаток вычисления. <code>(- n 1)</code> мы
можем вычислить сразу, а <code>(* n acc)</code> - нет, так как у нас больше нет параметра
<code>acc</code>.
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">fact-tail-call-cps</span> (n cont)
  (<span style="color: #af00ff;">cond</span> ((equal n 1)  (funcall cont 1))
        (t            (fact-tail-call-cps (- n 1)
                                          (<span style="color: #af00ff;">lambda</span> (x)
                                            (funcall cont (* n x)))))))
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">fact-tail-call-cps-start</span> (n)
  (fact-tail-call-cps n (<span style="color: #af00ff;">lambda</span> (x) x)))
</pre>
</div>

<p>
Здесь вместо аккумулятора мы передаем продолжение. Это продолжение представлят собой
лямбду, которая вызывает продолжение-параметр. Это продолжение-параметр вызывается с
аргументом, который представляет собой собственно вычисление (n * x). По-видимому, это
такой довольно интересный способ отложить вычисления до тех пор пока мы не достигнем
базы рекурсии.
</p>

<p>
В самом деле, при вызове <code>(fact-tail-call-cps 3 #'(lambda (x) x))</code>, когда мы достигнем
базы рекурсии будет выполнено это:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(funcall (<span style="color: #af00ff;">lambda</span> (x)
           (funcall (<span style="color: #af00ff;">lambda</span> (x)
                      (funcall (<span style="color: #af00ff;">lambda</span> (x)
                                 x)
                               (* 3 x)))
                    (* 2 x)))
         1)
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-14" class="outline-4">
<h4 id="unnumbered-14">Преобразование фибоначчи</h4>
<div class="outline-text-4" id="text-unnumbered-14">
<p>
Второй пример будет чуть сложнее - числа фибоначчи:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">fib</span> (n)
  (<span style="color: #af00ff;">cond</span> ((equal n 1)  1)
        ((equal n 2)  1)
        (t            (+ (fib (- n 1))
                         (fib (- n 2))))))
</pre>
</div>

<p>
Преобразуем вызов в хвосторекурсивный, используя аккумуляторы. С помощью них мы можем
уменьшить количество вложенных вызовов, если применим такую стратегию вычилений:
</p>

<p>
В первом параметре <code>n</code> будем декрементировать шаг вычисления, в последнем параметре на
каждом шаге будем передавать сумму аккумуляторов, а в предпоследнем - предыдущее
значение суммы.
</p>

<p>
Таким образом в последнем параметре при каждом вызове начнет накапливаться
последовательность сумм, а в предпоследнем - так же последовательность сумм, но со
сдвигом на шаг назад.
</p>

<p>
Когда счетчик <code>n</code> достаточно уменьшится мы сможем просто возвратить последний
параметр. Таким образом время вычисления из экспоненциального превращается в линейное.
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">ftc</span> (n <span style="color: #008700;">&amp;optional</span> (acc1 1) (acc2 1))
  (<span style="color: #af00ff;">cond</span> ((or (equal 1 n)
             (equal 2 n))  acc2)
        (t                 (ftc (- n 1) acc2 (+ acc1 acc2)))))
</pre>
</div>

<p>
Теперь перепишем в cps-стиле:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">ftc-cps</span> (n cont)
  (<span style="color: #af00ff;">cond</span> ((equal 1 n)  (funcall cont 1 1))
        ((equal 2 n)  (funcall cont 1 1))
        (t            (ftc-cps (- n 1)
                               (<span style="color: #af00ff;">lambda</span> (acc1 acc2)
                                 (funcall cont acc2 (+ acc1 acc2)))))))

(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">ftc-cps-start</span> (n)
  (ftc-cps n (<span style="color: #af00ff;">lambda</span> (acc1 acc2)
               acc2)))
</pre>
</div>

<p>
[TODO:gmm] - Здесь надо для тренировки превратить это в CPS.
</p>
</div>
</div>
