org/lrn/lisp/lisp-4.org
*** Преобразование функции обработки списка

Еще один пример, но этот раз для списка - функция, которая проходит по списку удваивая
каждый элемент:

#+BEGIN_SRC lisp
  (defun mul2 (lst)
    (cond ((null lst)  nil)
          (t           (cons (* 2 (car lst))
                             (mul2 (cdr lst))))))
#+END_SRC

Воспользовавшись тем же подходом получим ее хвосторекурсивный вариант:

#+BEGIN_SRC lisp
  (defun mul2 (lst &optional (acc nil))
    (cond ((null lst)  (reverse acc))
          (t           (mul2 (cdr lst)
                             (cons (* 2 (car lst)) acc)))))
#+END_SRC

Он обладает небольшим отличием, которое заключается в том, что в целях эффективности
база рекурсии переворачивает аккумулированный список, чтобы шаг рекурсии мог добавлять
элементы в начало списка-аккумулятора - это более эффективно.

Можно смотреть на процесс обработки списка как на перемещение головы списка ~lst~ в
голову ~acc~. Мы могли бы переименовать ~lst~ в "список еще невычесленных форм"
~unevaled~, а ~acc~ в "список уже вычисленных форм" ~evaled~:

#+BEGIN_SRC lisp
  (defun mul2 (unevaled &optional (evaled nil))
    (cond ((null unevaled)  (reverse evaled))
          (t                (mul2 (cdr unevaled)
                                  (cons (* 2 (car unevaled))
                                        evaled)))))
#+END_SRC

Следующим шагом можно отделить функцию, которая обрабатывает элементы списка. Зададим
ее как параметр:

#+BEGIN_SRC lisp
  (defun mul2 (fn unevaled &optional (evaled nil))
    (cond ((null unevaled)  (reverse evaled))
          (t                (mul2 fn
                                  (cdr unevaled)
                                  (cons (funcall fn (car unevaled))
                                        evaled)))))
#+END_SRC

По сути мы получили универсальную функцию-маппер, которая умеет обрабатывать список. Мы
можем сделать опциональный параметр обязательным и заставить ее рекурсивно обрабатывать
подсписки.

#+BEGIN_SRC lisp
  (defun mul2 (fn unevaled evaled)
    (cond ((null unevaled)  (reverse evaled))
          (t                (mul2 fn
                                  (cdr unevaled)
                                  (cons (funcall fn (car unevaled))
                                        evaled)))))
#+END_SRC

[TODO:gmm] - Для тренировки преобразовать в CPS?

