www/lrn/lisp/lisp-4.html

<div id="outline-container-unnumbered-15" class="outline-4">
<h4 id="unnumbered-15">Преобразование функции обработки списка</h4>
<div class="outline-text-4" id="text-unnumbered-15">
<p>
Еще один пример, но этот раз для списка - функция, которая проходит по списку удваивая
каждый элемент:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">mul2</span> (lst)
  (<span style="color: #af00ff;">cond</span> ((null lst)  nil)
        (t           (cons (* 2 (car lst))
                           (mul2 (cdr lst))))))
</pre>
</div>

<p>
Воспользовавшись тем же подходом получим ее хвосторекурсивный вариант:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">mul2</span> (lst <span style="color: #008700;">&amp;optional</span> (acc nil))
  (<span style="color: #af00ff;">cond</span> ((null lst)  (reverse acc))
        (t           (mul2 (cdr lst)
                           (cons (* 2 (car lst)) acc)))))
</pre>
</div>

<p>
Он обладает небольшим отличием, которое заключается в том, что в целях эффективности
база рекурсии переворачивает аккумулированный список, чтобы шаг рекурсии мог добавлять
элементы в начало списка-аккумулятора - это более эффективно.
</p>

<p>
Можно смотреть на процесс обработки списка как на перемещение головы списка <code>lst</code> в
голову <code>acc</code>. Мы могли бы переименовать <code>lst</code> в "список еще невычесленных форм"
<code>unevaled</code>, а <code>acc</code> в "список уже вычисленных форм" <code>evaled</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">mul2</span> (unevaled <span style="color: #008700;">&amp;optional</span> (evaled nil))
  (<span style="color: #af00ff;">cond</span> ((null unevaled)  (reverse evaled))
        (t                (mul2 (cdr unevaled)
                                (cons (* 2 (car unevaled))
                                      evaled)))))
</pre>
</div>

<p>
Следующим шагом можно отделить функцию, которая обрабатывает элементы списка. Зададим
ее как параметр:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">mul2</span> (fn unevaled <span style="color: #008700;">&amp;optional</span> (evaled nil))
  (<span style="color: #af00ff;">cond</span> ((null unevaled)  (reverse evaled))
        (t                (mul2 fn
                                (cdr unevaled)
                                (cons (funcall fn (car unevaled))
                                      evaled)))))
</pre>
</div>

<p>
По сути мы получили универсальную функцию-маппер, которая умеет обрабатывать список. Мы
можем сделать опциональный параметр обязательным и заставить ее рекурсивно обрабатывать
подсписки.
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">mul2</span> (fn unevaled evaled)
  (<span style="color: #af00ff;">cond</span> ((null unevaled)  (reverse evaled))
        (t                (mul2 fn
                                (cdr unevaled)
                                (cons (funcall fn (car unevaled))
                                      evaled)))))
</pre>
</div>

<p>
[TODO:gmm] - Для тренировки преобразовать в CPS?
</p>
</div>
</div>
