org/lrn/lisp/lisp-4.org
*** Преобразование EVLIS и MYEVAL

Теперь, обладая этим опытом, возьмем нашу старую функцию ~evis~ (из предыдущего этапа):

#+BEGIN_SRC lisp
  (defun evlis (lst env)
    (cond ((null lst)  nil)
          (t           (cons (myeval (car lst) env)
                             (evlis (cdr lst) env)))))
#+END_SRC

Переименуем ~lst~ в ~unevaled~:

#+BEGIN_SRC lisp
  (defun evlis (unevaled env)
    (cond ((null unevaled)  nil)
          (t           (cons (myeval (car unevaled) env)
                             (evlis (cdr unevaled) env)))))
#+END_SRC

Преобразуем рекурсию в хвостовую с аккумулятором, по аналогии с mul2:

#+BEGIN_SRC lisp
  (defun evlis (unevaled evaled env)
    (cond ((null unevaled)  (reverse evaled))
          (t                (evlis (cdr unevaled)
                                   (cons (myeval (car unevaled) env)
                                         evaled)))))
#+END_SRC

Мы помним, что сейчас ~myeval~ принимает продолжения. Значит и ~evlis~ должен их принимать:

#+BEGIN_SRC lisp
  (defun evlis (unevaled evaled env errcont cont)
    (cond ((null unevaled)  (reverse evaled))
          (t                (evlis (cdr unevaled)
                                   (cons (myeval (car unevaled) env errcont cont)
                                         evaled)
                                   env errcont cont))))
#+END_SRC

Теперь проведем CPS-преобразование. Вызов ~myeval~ - первый из вычисляемых и имеющих
продолжение, поэтому мы можем передать ему все остальное как параметр ~cont~.

#+BEGIN_SRC lisp
  (defun evlis (unevaled evaled env errcont cont)
    (cond ((null unevaled)  (funcall cont (reverse evaled)))
          (t                (myeval (car unevaled) env errcont
                                    (lambda (x)
                                      (evlis (cdr unevaled)
                                             (cons x evaled)
                                             env errcont cont))))))
#+END_SRC

Вспомним, как выглядит наша функция MYAPPLY из предыдущего раздела:

#+BEGIN_SRC lisp
  (defun myeval (lst env)
    (cond
      ...
      (t
       (myapply (myeval (car lst) env)
                (evlis (cdr lst) env)))))
#+END_SRC

Если мы преобразуем ее в CPS-стиль, то у нас получится вот так:

#+BEGIN_SRC lisp
  (defun myeval (exp env errcont cont)
    (cond
      ...
      (t
       (myeval (car exp) env errcont
               (lambda (x) ;; x - это результат вычисления формы (car list)
                 (evlis (cdr exp) nil env errcont
                        (lambda (y) ;; y - это список форм
                          (myapply x y errcont cont))))))))
#+END_SRC

Здесь есть неприятный момент, связанный с тем, что последнее продолжение ~(y)~ не
соответствует шагу вычисления интерпретатора. Если бы у нас был отладчик, позволяющий
перемещаться по продолжениям вверх и вниз, то мы бы обнаружили, что продолжения, не
соответствующие шагам вычисления интерпретатора, мешают.

Пользователь языка мыслит в терминах вычисления форм, а не в терминах внутренних
продолжений интерпретатора, соответственно продолжения должны повторять это мышение в
терминах вычисления форм. Следовательно, нужно выделять продолжения так, чтобы каждому
продолжению соответстовала форма. Например, у Гая Стила в интерпретаторе ~foo~
https://gist.github.com/fogus/3698078 лишние продолжения, но если нет отладчика
продолжений, то пользователь языка этого, конечно, не заметит.

Однако, мы можем избавиться от лишнего продолжения и сейчас покажем это.

Если взять оригинальный EVLIS и преобразовать его CPS то получится вот так:

#+BEGIN_SRC lisp
  (defun evlis-orig-cps (lst env errcont cont)
    (cond ((null lst) nil)
          (t (myeval (car lst) env errcont
                     (lambda (x)    ; результат формы (car lst)
                       (evlis (cdr lst) env errcont
                              (lambda (y)  ; список выч. форм
                                (funcall cont (cons x y)))))))))
#+END_SRC

А если перед этим сделать его хвосторекурсивным с аккумулятором и только потом
преобразовать в CPS - то получится так:

#+BEGIN_SRC lisp
  (defun evlis (unevaled evaled env errcont cont)
    (cond ((null unevaled)  (funcall cont (reverse evaled)))
          (t                (myeval (car unevaled) env errcont
                                    (lambda (x)
                                      (evlis (cdr unevaled)
                                             (cons x evaled)
                                             env errcont cont))))))
#+END_SRC

Как мы видим из MYEVAL

#+BEGIN_SRC lisp
  (defun myeval (exp env errcont cont)
    (cond
      ...
      (t
       (myeval (car exp) env errcont
               (lambda (x)
                 (evlis (cdr exp) nil env errcont
                        (lambda (y)   ; y -- список форм
                          (myapply x y errcont cont))))))))
#+END_SRC

Нужно преобразовать evlis так чтобы продожение в myeval где комментарий "y -- список
форм" исчезло

Для этого мы переместим функционал ~myapply~ (применение функции к аргументам) прямо в
~evlis~, передав ему функцию, которую будем применять. Тогда выйдет вот так:

#+BEGIN_SRC lisp
  (defun myeval (exp env errcont cont)
    (cond
      ...
      (myeval (car exp) env errcont
              (lambda (x)
                (evlis x (cdr exp) nil env errcont cont)))))
#+END_SRC

#+BEGIN_SRC lisp
  (defun evlis (fn unevaled evaled env errcont cont)
    (cond ((null unevaled)  (myapply fn (reverse evaled) errcont cont))
          (t                (myeval (car unevaled) env errcont
                                    (lambda (x)
                                      (evlis fn
                                             (cdr unevaled)
                                             (cons x evaled)
                                             env errcont cont))))))
#+END_SRC

Что мы и видим в результате:

#+NAME: myeval_evlis_4
#+BEGIN_SRC lisp
  ;; менее эффективный но более понятный вариант evlis
  (defun evlis (fn unevaled evaled env errcont cont)
    (cond ((null unevaled)  (myapply fn evaled errcont cont))
          (t                (myeval (car unevaled) env errcont
                                    (lambda (x)
                                      (evlis fn
                                             (cdr unevaled)
                                             (append evaled (list x))
                                             env errcont cont))))))

  ;; более эффективный вариант evlis
  (defun evlis (fn unevaled evaled env errcont cont)
    (cond ((null unevaled)  (myapply fn (reverse evaled) errcont cont))
          (t                (myeval (car unevaled) env errcont
                                    (lambda (x)
                                      (evlis fn
                                             (cdr unevaled)
                                             (cons x evaled)
                                             env errcont cont))))))

#+END_SRC

Роман:

Потом еще fn добавить надо, чтобы удовлетворить нашиму (ограниченному) пониманию
cps. Таким образом итоговый evlis сначала вычисляет аргументы, а потом применяет
функцию. Оригинальный evlis делал только первое.

Михаил:

а зачем нам fn?

Роман:

Вот тут же:

#+BEGIN_SRC lisp
  (defun evlis (fn unevaled evaled env errcont cont)
    (cond ((null unevaled) (myapply fn (reverse evaled) errcont cont))
          ...
          ))

#+END_SRC

Иначе будут континуации, которые не соответствуют шагу вычислений.
Так не пойдет:

#+BEGIN_SRC lisp
  (defun evlis (unevaled evaled env errcont cont)
    (cond ((null unevaled) (funcall cont evaled))
          ...
          ))
#+END_SRC

Потому что cont тогда принимает не результат формы, а список результатов, что
противоречит нашему пониманию cps.

Роман:

Одна из причин преобразования в cps — сделать рекурсию хвостовой. Применение cps к
функции с хвостовой рекурсией вообще ничего не дает. Вот evlis — другое
дело. Преобразовав ее к хвостовому виду добавив аккумулятор, мы еще не привели к
хвостовому виду вызов myeval. Вот поэтому мы и делаем cps над evlis с хвостовой
рекурсией.

