www/lrn/lisp/lisp-4.html

<div id="outline-container-unnumbered-16" class="outline-4">
<h4 id="unnumbered-16">Преобразование EVLIS и MYEVAL</h4>
<div class="outline-text-4" id="text-unnumbered-16">
<p>
Возьмем нашу функцию <code>evis</code> (из предыдущего этапа):
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evlis</span> (unevaled evaled env)
  (<span style="color: #af00ff;">cond</span> ((null unevaled)  (reverse evaled))
        (t                (evlis (cdr unevaled)
                                 (cons (myeval (car unevaled) env)
                                       evaled)))))
</pre>
</div>

<p>
Мы помним, что сейчас <code>myeval</code> принимает продолжения. Значит и <code>evlis</code> должен их принимать:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evlis</span> (unevaled evaled env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null unevaled)  (reverse evaled))
        (t                (evlis (cdr unevaled)
                                 (cons (myeval (car unevaled) env errcont cont)
                                       evaled)
                                 env errcont cont))))
</pre>
</div>

<p>
Теперь проведем CPS-преобразование. Вызов <code>myeval</code> - первый из вычисляемых и имеющих
продолжение, поэтому мы можем передать ему все остальное как параметр <code>cont</code>.
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evlis</span> (unevaled evaled env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null unevaled)  (funcall cont (reverse evaled)))
        (t                (myeval (car unevaled) env errcont
                                  (<span style="color: #af00ff;">lambda</span> (x)
                                    (evlis (cdr unevaled)
                                           (cons x evaled)
                                           env errcont cont))))))
</pre>
</div>

<p>
Вспомним, как выглядит наша функция MYAPPLY из предыдущего раздела:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">myeval</span> (lst env)
  (<span style="color: #af00ff;">cond</span>
    ...
    (t
     (myapply (myeval (car lst) env)
              (evlis (cdr lst) nil env)))))
</pre>
</div>

<p>
Если мы преобразуем ее в CPS-стиль, то у нас получится вот так:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">myeval</span> (exp env errcont cont)
  (<span style="color: #af00ff;">cond</span>
    ...
    (t
     (myeval (car exp) env errcont
             (<span style="color: #af00ff;">lambda</span> (x) <span style="color: #af0000;">;; </span><span style="color: #af0000;">x - &#1101;&#1090;&#1086; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1092;&#1086;&#1088;&#1084;&#1099; (car list)</span>
               (evlis (cdr exp) nil env errcont
                      (<span style="color: #af00ff;">lambda</span> (y) <span style="color: #af0000;">;; </span><span style="color: #af0000;">y - &#1101;&#1090;&#1086; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1092;&#1086;&#1088;&#1084;</span>
                        (myapply x y errcont cont))))))))
</pre>
</div>

<p>
Здесь есть неприятный момент, связанный с тем, что последнее продолжение <code>(y)</code> не
соответствует шагу вычисления интерпретатора. Если бы у нас был отладчик, позволяющий
перемещаться по продолжениям вверх и вниз, то мы бы обнаружили, что продолжения, не
соответствующие шагам вычисления интерпретатора, мешают.
</p>

<p>
Пользователь языка мыслит в терминах вычисления форм, а не в терминах внутренних
продолжений интерпретатора, соответственно продолжения должны повторять это мышение в
терминах вычисления форм. Следовательно, нужно выделять продолжения так, чтобы каждому
продолжению соответстовала форма. Например, у Гая Стила в интерпретаторе <code>foo</code>
<a href="https://gist.github.com/fogus/3698078">https://gist.github.com/fogus/3698078</a> лишние продолжения, но если нет отладчика
продолжений, то пользователь языка этого, конечно, не заметит.
</p>

<p>
Однако, мы можем избавиться от лишнего продолжения и сейчас покажем это.
</p>

<p>
Если взять оригинальный, не хвосторекурсивный <code>evlis</code> и преобразовать его CPS то
получится вот так:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evlis-orig-cps</span> (lst env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null lst) nil)
        (t (myeval (car lst) env errcont
                   (<span style="color: #af00ff;">lambda</span> (x)    <span style="color: #af0000;">; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1092;&#1086;&#1088;&#1084;&#1099; (car lst)</span>
                     (evlis (cdr lst) env errcont
                            (<span style="color: #af00ff;">lambda</span> (y)  <span style="color: #af0000;">; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1074;&#1099;&#1095;. &#1092;&#1086;&#1088;&#1084;</span>
                              (funcall cont (cons x y)))))))))
</pre>
</div>

<p>
А если перед этим сделать его хвосторекурсивным с аккумулятором и только потом
преобразовать в CPS - то получится так:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evlis</span> (unevaled evaled env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null unevaled)  (funcall cont (reverse evaled)))
        (t                (myeval (car unevaled) env errcont
                                  (<span style="color: #af00ff;">lambda</span> (x)
                                    (evlis (cdr unevaled)
                                           (cons x evaled)
                                           env errcont cont))))))
</pre>
</div>

<p>
Как мы видим из MYEVAL
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">myeval</span> (exp env errcont cont)
  (<span style="color: #af00ff;">cond</span>
    ...
    (t
     (myeval (car exp) env errcont
             (<span style="color: #af00ff;">lambda</span> (x)
               (evlis (cdr exp) nil env errcont
                      (<span style="color: #af00ff;">lambda</span> (y)   <span style="color: #af0000;">; y -- &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1092;&#1086;&#1088;&#1084;</span>
                        (myapply x y errcont cont))))))))
</pre>
</div>

<p>
Нужно преобразовать evlis так, чтобы продожение в myeval где комментарий "y &#x2013; список
форм" исчезло
</p>

<p>
Для этого мы переместим функционал <code>myapply</code> (применение функции к аргументам) прямо в
<code>evlis</code>, передав ему функцию, которую будем применять. Тогда выйдет вот так:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">myeval</span> (exp env errcont cont)
  (<span style="color: #af00ff;">cond</span>
    ...
    (myeval (car exp) env errcont
            (<span style="color: #af00ff;">lambda</span> (x)
              (evlis x (cdr exp) nil env errcont cont)))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evlis</span> (fn unevaled evaled env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null unevaled)  (myapply fn (reverse evaled) errcont cont))
        (t                (myeval (car unevaled) env errcont
                                  (<span style="color: #af00ff;">lambda</span> (x)
                                    (evlis fn
                                           (cdr unevaled)
                                           (cons x evaled)
                                           env errcont cont))))))
</pre>
</div>

<p>
Что мы и видим в результате:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_evlis_4"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1084;&#1077;&#1085;&#1077;&#1077; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1085;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1099;&#1081; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; evlis</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evlis</span> (fn unevaled evaled env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null unevaled)  (myapply fn evaled errcont cont))
        (t                (myeval (car unevaled) env errcont
                                  (<span style="color: #af00ff;">lambda</span> (x)
                                    (evlis fn
                                           (cdr unevaled)
                                           (append evaled (list x))
                                           env errcont cont))))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1086;&#1083;&#1077;&#1077; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; evlis</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evlis</span> (fn unevaled evaled env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null unevaled)  (myapply fn (reverse evaled) errcont cont))
        (t                (myeval (car unevaled) env errcont
                                  (<span style="color: #af00ff;">lambda</span> (x)
                                    (evlis fn
                                           (cdr unevaled)
                                           (cons x evaled)
                                           env errcont cont))))))
</pre>
</div>

<p>
Роман:
</p>

<p>
Потом еще fn добавить надо, чтобы удовлетворить нашиму (ограниченному) пониманию
cps. Таким образом итоговый evlis сначала вычисляет аргументы, а потом применяет
функцию. Оригинальный evlis делал только первое.
</p>

<p>
Михаил:
</p>

<p>
а зачем нам fn?
</p>

<p>
Роман:
</p>

<p>
Вот тут же:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evlis</span> (fn unevaled evaled env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null unevaled) (myapply fn (reverse evaled) errcont cont))
        ...
        ))
</pre>
</div>

<p>
Иначе будут континуации, которые не соответствуют шагу вычислений.
Так не пойдет:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evlis</span> (unevaled evaled env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null unevaled) (funcall cont evaled))
        ...
        ))
</pre>
</div>

<p>
Потому что cont тогда принимает не результат формы, а список результатов, что
противоречит нашему пониманию cps.
</p>

<p>
Роман:
</p>

<p>
Одна из причин преобразования в cps — сделать рекурсию хвостовой. Применение cps к
функции с хвостовой рекурсией вообще ничего не дает. Вот evlis — другое
дело. Преобразовав ее к хвостовому виду добавив аккумулятор, мы еще не привели к
хвостовому виду вызов myeval. Вот поэтому мы и делаем cps над evlis с хвостовой
рекурсией.
</p>
</div>
</div>
</div>
