org/lrn/lisp/lisp-4.org
** Самовычисляемые формы

теперь используют продолжения

#+NAME: myeval_number_4
#+BEGIN_SRC lisp
  ((null exp)                  (funcall cont 'nil))
  ((equal t exp)               (funcall cont 't))
  ((member exp '(+ * car cdr cons null print or and list))  (funcall cont exp))
  ((numberp exp)               (funcall cont exp))
#+END_SRC

Тесты незначительно изменяются

#+NAME: myeval_number_4_test
#+BEGIN_SRC lisp
  ;; Тесты для самовычисляемых форм
  (assert (equal T (myeval 'T nil #'err #'ok)))
  (assert (equal NIL (myeval 'NIL nil #'err #'ok)))
  (assert (equal 999 (myeval 999 nil #'err #'ok)))
#+END_SRC

** Вычисление символов

...стало проще. Теперь вместо сигнализирования ошибки, когда символ не найден, lookup
просто вызовет (другое) error-продолжение. Поэтому класс ошибки ~var-not-found-error~
нам больше не требуется.

#+NAME: myeval_symb_4
#+BEGIN_SRC lisp
  ((symbolp exp)               (lookup exp env errcont cont))
#+END_SRC

Соответственно изменился и тест - теперь мы ожидаем, что будет выполнено
error-продолжение.

#+NAME: myeval_symb_4_test
#+BEGIN_SRC lisp
  ;; Тесты для вычисления символов
  (assert (equal 6 (myeval 'b '((a . 3) (b . 6)) #'err #'ok)))
  (assert (equal "error" (car (myeval 'b nil
                                      #'(lambda (x) (cons "error" x))
                                      #'ok))))
#+END_SRC

** Цитирование

теперь вызывает продолжение

#+NAME: myeval_quote_4
#+BEGIN_SRC lisp
  ((equal (car exp) 'quote)    (funcall cont (cadr exp)))
#+END_SRC

#+NAME: myeval_quote_4_test
#+BEGIN_SRC lisp
  ;; Тесты для QUOTE
  (assert (equal '(+ 1 2) (myeval '(quote (+ 1 2)) nil #'err #'ok)))
#+END_SRC

** Условное выполнение IF

Чтобы сделать IF в CPS-стиле мы вызываем ~myeval~, чтобы вычислить значение
выражения-условия. При этом мы передаем в параметр ~cont~ лямбду, которая в зависимости
от значения вычисления вызовет ту или иную ветку:

#+NAME: myeval_if_4
#+BEGIN_SRC lisp
  ((equal (car exp) 'if)       (myeval (cadr exp) env errcont
                                       (lambda (x)
                                         (if x
                                             (myeval (caddr exp)  env errcont cont)
                                             (myeval (cadddr exp) env errcont cont)))))
#+END_SRC

#+NAME: myeval_if_4_test
#+BEGIN_SRC lisp
  ;; Тесты для IF
  (assert (equal 2 (myeval '(if () 1 2) nil #'err #'ok)))
  (assert (equal 1 (myeval '(if (null ()) 1 2) nil #'err #'ok)))
  ;; Тесты для IF, где условие вычисляется в окружении
  (assert (equal 2 (myeval '(if a 1 2) '((a . ())) #'err #'ok)))
  (assert (equal 1 (myeval '(if a 1 2) '((a . 1)) #'err #'ok)))
#+END_SRC

** COND

Модифицируем ~evcond~ в CPS-стиле. Это примерно то же самое, что и IF в CPS-стиле, с
той особенность, что если вычисление условия не вернуло ~T~, то мы рекурсивно вычисляем
от остатка переданного списка условий. Мы так делали и раньше в ~evcond~, просто тут
рекурсия перехала в продолжения.

#+NAME: myeval_evcond_4
#+BEGIN_SRC lisp
  (defun evcond (exp env errcont cont)
    (cond ((null exp)  (funcall cont nil))
          (t           (myeval (caar exp) env errcont
                               (lambda (x)
                                 (if x
                                     (myeval (cadar exp) env errcont cont)
                                     (evcond (cdr exp)   env errcont cont)))))))
#+END_SRC

#+NAME: myeval_evcond_4_test
#+BEGIN_SRC lisp
  ;; Тесты для EVCOND
  (assert (equal 2   (evcond '((t 2)   (t 1)) nil #'err #'ok)))
  (assert (equal 1   (evcond '((nil 2) (t 1)) nil #'err #'ok)))
  (assert (equal nil (evcond '((nil 2) (nil 1)) nil #'err #'ok)))
  ;; Тесты для EVCOND, где участвует окружение
  (assert (equal 2 (evcond '((a 2) (b 1))
                           '((a . 1) (b . ()))
                           #'err #'ok)))
  (assert (equal 1 (evcond '((a 2) (b 1))
                           '((a . nil) (b . T))
                           #'err #'ok)))
#+END_SRC

и адаптируем вызов внутри ~myeval~:

#+NAME: myeval_cond_4
#+BEGIN_SRC lisp
  ((equal (car exp) 'cond)     (funcall cont (evcond (cdr exp) env errcont cont)))
#+END_SRC

#+NAME: myeval_cond_4_test
#+BEGIN_SRC lisp
  ;; Тесты для COND
  (assert (equal 2 (myeval '(cond
                             (() 1)
                             (1 2))
                           nil #'err #'ok)))
  (assert (equal 2 (myeval '(cond
                             (a 1)
                             (b 2))
                           '((a . ()) (b . 1))
                           #'err #'ok)))
  (assert (equal 1 (myeval '(cond
                             (a 1)
                             (b 2))
                           '((a . 1) (b . ()))
                           #'err #'ok)))
#+END_SRC

