www/lrn/lisp/lisp-4.html

<div id="outline-container-unnumbered-17" class="outline-3">
<h3 id="unnumbered-17">Самовычисляемые формы</h3>
<div class="outline-text-3" id="text-unnumbered-17">
<p>
теперь используют продолжения
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_number_4">((null exp)                  (funcall cont 'nil))
((equal t exp)               (funcall cont 't))
((member exp '(+ * car cdr cons null print))  (funcall cont exp))
((numberp exp)               (funcall cont exp))
</pre>
</div>

<p>
Тесты незначительно изменяются
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_number_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; &#1089;&#1072;&#1084;&#1086;&#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1092;&#1086;&#1088;&#1084;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal T (myeval 'T nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal NIL (myeval 'NIL nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 999 (myeval 999 nil #'err #'ok)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-18" class="outline-3">
<h3 id="unnumbered-18">Вычисление символов</h3>
<div class="outline-text-3" id="text-unnumbered-18">
<p>
&#x2026;стало проще. Теперь вместо сигнализирования ошибки, когда символ не найден, lookup
просто вызовет (другое) error-продолжение. Поэтому класс ошибки <code>var-not-found-error</code>
нам больше не требуется.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_symb_4">((symbolp exp)               (lookup exp env errcont cont))
</pre>
</div>

<p>
Соответственно изменился и тест - теперь мы ожидаем, что будет выполнено
error-продолжение.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_symb_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 6 (myeval 'b '((a . 3) (b . 6)) #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"error"</span> (car (myeval 'b nil
                                    #'(<span style="color: #af00ff;">lambda</span> (x) (cons <span style="color: #87005f;">"error"</span> x))
                                    #'ok))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-19" class="outline-3">
<h3 id="unnumbered-19">Цитирование</h3>
<div class="outline-text-3" id="text-unnumbered-19">
<p>
теперь вызывает продолжение
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_quote_4">((equal (car exp) 'quote)    (funcall cont (cadr exp)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_quote_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; QUOTE</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(+ 1 2) (myeval '(quote (+ 1 2)) nil #'err #'ok)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-20" class="outline-3">
<h3 id="unnumbered-20">Условное выполнение IF</h3>
<div class="outline-text-3" id="text-unnumbered-20">
<p>
Чтобы сделать IF в CPS-стиле мы вызываем <code>myeval</code>, чтобы вычислить значение
выражения-условия. При этом мы передаем в параметр <code>cont</code> лямбду, которая в зависимости
от значения вычисления вызовет ту или иную ветку:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_if_4">((equal (car exp) 'if)       (myeval (cadr exp) env errcont
                                     (<span style="color: #af00ff;">lambda</span> (x)
                                       (<span style="color: #af00ff;">if</span> x
                                           (myeval (caddr exp)  env errcont cont)
                                           (myeval (cadddr exp) env errcont cont)))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_if_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; IF</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">if</span> () 1 2) nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(<span style="color: #af00ff;">if</span> (null ()) 1 2) nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; IF, &#1075;&#1076;&#1077; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">if</span> a 1 2) '((a . ())) #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(<span style="color: #af00ff;">if</span> a 1 2) '((a . 1)) #'err #'ok)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-21" class="outline-3">
<h3 id="unnumbered-21">COND</h3>
<div class="outline-text-3" id="text-unnumbered-21">
<p>
Модифицируем <code>evcond</code> в CPS-стиле. Это примерно то же самое, что и IF в CPS-стиле, с
той особенность, что если вычисление условия не вернуло <code>T</code>, то мы рекурсивно вычисляем
от остатка переданного списка условий. Мы так делали и раньше в <code>evcond</code>, просто тут
рекурсия перехала в продолжения.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_evcond_4">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evcond</span> (exp env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null exp)  (funcall cont nil))
        (t           (myeval (caar exp) env errcont
                             (<span style="color: #af00ff;">lambda</span> (x)
                               (<span style="color: #af00ff;">if</span> x
                                   (myeval (cadar exp) env errcont cont)
                                   (evcond (cdr exp)   env errcont cont)))))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_evcond_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; EVCOND</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2   (evcond '((t 2)   (t 1)) nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1   (evcond '((nil 2) (t 1)) nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal nil (evcond '((nil 2) (nil 1)) nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; EVCOND, &#1075;&#1076;&#1077; &#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1077;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (evcond '((a 2) (b 1))
                         '((a . 1) (b . ()))
                         #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (evcond '((a 2) (b 1))
                         '((a . nil) (b . T))
                         #'err #'ok)))
</pre>
</div>

<p>
и адаптируем вызов внутри <code>myeval</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_cond_4">((equal (car exp) 'cond)     (funcall cont (evcond (cdr exp) env errcont cont)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_cond_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; COND</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">cond</span>
                           (() 1)
                           (1 2))
                         nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">cond</span>
                           (a 1)
                           (b 2))
                         '((a . ()) (b . 1))
                         #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(<span style="color: #af00ff;">cond</span>
                           (a 1)
                           (b 2))
                         '((a . 1) (b . ()))
                         #'err #'ok)))
</pre>
</div>
</div>
</div>
