org/lrn/lisp/lisp-4.org
** PROGN

Аналогичным образом преобразуем ~evprogn~ в CPS.

#+NAME: myeval_evprogn_4
#+BEGIN_SRC lisp
  (defun evprogn (lst env errcont cont)
    (cond ((null lst)         (funcall cont nil))
          ((null (cdr lst))   (myeval (car lst) env errcont cont))
          (t                  (myeval (car lst) env errcont
                                      (lambda (x)
                                        (evprogn (cdr lst) env errcont cont))))))
#+END_SRC

#+NAME: myeval_evprogn_4_test
#+BEGIN_SRC lisp
  ;; Тест для EVPROGN
  (assert (equal 2 (evprogn '(1 2) nil  #'err #'ok)))
  ;; Тест для EVPROGN в окружении
  (assert (equal 3 (evprogn '(a b c)
                            '((a . 1) (b . 2) (c . 3))
                            #'err #'ok)))
#+END_SRC

модифицируем вызов в ~myeval~:

#+NAME: myeval_progn_4
#+BEGIN_SRC lisp
  ((equal (car exp) 'progn)    (evprogn (cdr exp) env errcont cont))
#+END_SRC

#+NAME: myeval_progn_4_test
#+BEGIN_SRC lisp
  ;; Тест для PROGN
  (assert (equal 3 (myeval '(progn 1 2 3) nil #'err #'ok)))
  ;; Тест для PROGN в окружении
  (assert (equal 3 (myeval '(progn a b c) '((a . 1) (b . 2) (c . 3)) #'err #'ok)))
#+END_SRC

** CANCEL PRINT

PRINT - это функция, поэтому она должна обрабатываться в MYAPPLY. Туда мы ее и
перенесли.

** TODO LIST

LIST - это функция, т.к. она оценивает свои аргументы. В будущем, мы перенесем LIST из
~myeval~ в ~myapply~, но пока не будем делать этого, а только и научим его принимать
продолжения

Как мы помним, в разделе [[*Преобразование EVLIS и MYAPPLY][Преобразование EVLIS и MYAPPLY]] мы получили новый ~evlis~ в
CPS-стиле. Теперь здесь мы напишем тесты для него:

#+NAME: myeval_evlis_4_test
#+BEGIN_SRC lisp
  ;; Тест для EVLIS
  (assert (equal 4         (evlis '+     '(1 (+ 1 2))             nil nil #'err #'ok)))
  (assert (equal '(1 3 5)  (evlis 'list  '(1 (+ 1 2) 5)           nil nil #'err #'ok)))


  (defun evlis (fn unevaled evaled env errcont cont)
    (cond ((null unevaled)  (myapply fn (reverse evaled) errcont cont))
          (t                (myeval (car unevaled) env errcont
                                    (lambda (x)
                                      (evlis fn
                                             (cdr unevaled)
                                             (cons x evaled)
                                             env errcont cont))))))

  (trace evlis)

  (assert (equal (+ 1 3 5) (evlis '+     '(1 (+ 1 2) 5)           nil nil #'err #'ok)))

  ;; (assert (equal '(3 6 42) (evlis 'list '((+ a b) (* b c) 42)
  ;;                                 '((a . 1) (b . 2) (c . 3) (d . 4))
  ;;                                 nil #'err #'ok)))
  ;; Тесты для LIST
  (assert (equal '(1 2 3)  (myeval '(list 1 2 3) nil #'err #'ok)))

  (list 1 (+ 1 2) (* 2 3) 42)
#+END_SRC




#+NAME: myapply_list_4
#+BEGIN_SRC lisp
  ((equal fn 'list)            (funcall cont args))
#+END_SRC

И тесты для LIST

#+NAME: myapply_list_4_test
#+BEGIN_SRC lisp
  ;; Тесты для LIST
  (assert (equal '(1 14) (myeval '(list 1 (+ 2 (* 3 4)))
                                 nil #'err #'ok)))

#+END_SRC

[TODO:gmm] Не все тесты работают (неработающие закомментированы)!



#+NAME: myeval_list_4
#+BEGIN_SRC lisp
  ((equal (car exp) 'list)     (evlis 'list (cdr exp) nil env errcont cont))
#+END_SRC


#+NAME: myeval_list_4_test
#+BEGIN_SRC lisp
  (assert (equal '(3 6 42)
                 (myeval '(list (+ 1 2) (* 2 3) 42) nil #'err #'ok)))
  (assert (equal '(3 6 42)
                 (myeval '(list (+ a b) (* b c) 42)
                         '((a . 1) (b . 2) (c . 3) (d . 4))
                         #'err #'ok)))
#+END_SRC



