www/lrn/lisp/lisp-4.html

<div id="outline-container-unnumbered-22" class="outline-3">
<h3 id="unnumbered-22">PROGN</h3>
<div class="outline-text-3" id="text-unnumbered-22">
<p>
Аналогичным образом преобразуем <code>evprogn</code> в CPS.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_evprogn_4">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evprogn</span> (lst env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null lst)         (funcall cont nil))
        ((null (cdr lst))   (myeval (car lst) env errcont cont))
        (t                  (myeval (car lst) env errcont
                                    (<span style="color: #af00ff;">lambda</span> (x)
                                      (evprogn (cdr lst) env errcont cont))))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_evprogn_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090; &#1076;&#1083;&#1103; EVPROGN</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (evprogn '(1 2) nil  #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090; &#1076;&#1083;&#1103; EVPROGN &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (evprogn '(a b c)
                          '((a . 1) (b . 2) (c . 3))
                          #'err #'ok)))
</pre>
</div>

<p>
модифицируем вызов в <code>myeval</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_progn_4">((equal (car exp) 'progn)    (evprogn (cdr exp) env errcont cont))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_progn_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090; &#1076;&#1083;&#1103; PROGN</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(<span style="color: #af00ff;">progn</span> 1 2 3) nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090; &#1076;&#1083;&#1103; PROGN &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(<span style="color: #af00ff;">progn</span> a b c) '((a . 1) (b . 2) (c . 3)) #'err #'ok)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-23" class="outline-3">
<h3 id="unnumbered-23"><span class="done CANCEL">CANCEL</span> PRINT</h3>
<div class="outline-text-3" id="text-unnumbered-23">
<p>
PRINT - это функция, поэтому она должна обрабатываться в MYAPPLY. Туда мы ее и
перенесли.
</p>
</div>
</div>

<div id="outline-container-unnumbered-24" class="outline-3">
<h3 id="unnumbered-24"><span class="todo TODO">TODO</span> LIST</h3>
<div class="outline-text-3" id="text-unnumbered-24">
<p>
LIST - это функция, т.к. она оценивает свои аргументы. В будущем, мы перенесем LIST из
<code>myeval</code> в <code>myapply</code>, но пока не будем делать этого, а только научим его принимать
продолжения
</p>

<p>
Как мы помним, в разделе <i>Преобразование EVLIS и MYAPPLY</i> мы получили новый <code>evlis</code> в
CPS-стиле. Теперь здесь мы напишем тесты для него:
</p>

<p>
[TODO:gmm] EVLIS работает неправильно с LIST
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_evlis_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090; &#1076;&#1083;&#1103; EVLIS</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 4         (evlis '+     '(1 (+ 1 2))             nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (+ 1 3 5) (evlis '+     '(1 (+ 1 2) 5)           nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1069;&#1090;&#1086;&#1090; &#1090;&#1077;&#1089;&#1090; &#1085;&#1077; &#1087;&#1088;&#1086;&#1093;&#1086;&#1076;&#1080;&#1090;</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">(assert (equal '(1 3 5)  (evlis 'list  '(1 (+ 1 2) 5)           nil nil #'err #'ok)))</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">(assert (equal '(3 6 42) (evlis 'list '((+ a b) (* b c) 42)</span>
<span style="color: #af0000;">;;                                 </span><span style="color: #af0000;">'((a . 1) (b . 2) (c . 3) (d . 4))</span>
<span style="color: #af0000;">;;                                 </span><span style="color: #af0000;">nil #'err #'ok)))</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_list_4">((equal fn 'list)            (funcall cont args))
</pre>
</div>

<p>
И тесты для LIST
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_list_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; LIST (&#1085;&#1077; &#1087;&#1088;&#1086;&#1093;&#1086;&#1076;&#1080;&#1090;)</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">(assert (equal '(1 14) (myeval '(list 1 (+ 2 (* 3 4)))</span>
<span style="color: #af0000;">;;                                </span><span style="color: #af0000;">nil #'err #'ok)))</span>
</pre>
</div>

<p>
[TODO:gmm] Не все тесты работают (неработающие закомментированы)!
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_list_4">((equal (car exp) 'list)     (evlis 'list (cdr exp) nil env errcont cont))
</pre>
</div>


<div class="org-src-container">

<pre class="src src-lisp" id="myeval_list_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">(assert (equal '(3 6 42)</span>
<span style="color: #af0000;">;;                </span><span style="color: #af0000;">(myeval '(list (+ 1 2) (* 2 3) 42) nil #'err #'ok)))</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">(assert (equal '(3 6 42)</span>
<span style="color: #af0000;">;;                </span><span style="color: #af0000;">(myeval '(list (+ a b) (* b c) 42)</span>
<span style="color: #af0000;">;;                        </span><span style="color: #af0000;">'((a . 1) (b . 2) (c . 3) (d . 4))</span>
<span style="color: #af0000;">;;                        </span><span style="color: #af0000;">#'err #'ok)))</span>
</pre>
</div>
</div>
</div>
