www/lrn/lisp/lisp-4.html

<div id="outline-container-unnumbered-27" class="outline-3">
<h3 id="unnumbered-27">LET</h3>
<div class="outline-text-3" id="text-unnumbered-27">
<p>
Ошибка <code>mypairlis-error</code> нам все еще нужна
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="errors_4">(<span style="color: #af00ff;">define-condition</span> <span style="color: #0000ff;">mypairlis-error</span> (<span style="color: #ff0000; font-weight: bold;">error</span>)
  ((lst1 <span style="color: #5f5f87;">:initarg</span> <span style="color: #5f5f87;">:lst1</span>  <span style="color: #5f5f87;">:reader</span> lst1)
   (lst2 <span style="color: #5f5f87;">:initarg</span> <span style="color: #5f5f87;">:lst2</span>  <span style="color: #5f5f87;">:reader</span> lst2))
  (<span style="color: #5f5f87;">:report</span>
   (<span style="color: #af00ff;">lambda</span> (condition stream)
     (format stream <span style="color: #87005f;">"Error in MYPAIRLIS: wrong params:~%'~A~%'~A"</span>
             (lst1 condition) (lst2 condition)))))
</pre>
</div>

<p>
Функция <code>mypairlis</code> остается без изменений
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_mypairlis_4">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">mypairlis</span> (lst1 lst2 alist)
  (<span style="color: #af00ff;">cond</span> ((and (null lst1) (null lst2))  alist)
        ((or  (null lst1) (null lst2))  (<span style="color: #ff0000; font-weight: bold;">error</span> 'mypairlis-error <span style="color: #5f5f87;">:lst1</span> lst1 <span style="color: #5f5f87;">:lst2</span> lst2))
        (t                              (cons (cons (car lst1)
                                                    (car lst2))
                                              (mypairlis (cdr lst1)
                                                         (cdr lst2)
                                                         alist)))))
</pre>
</div>

<p>
И ее тесты тоже
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_mypairlis_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; MYPAIRLIS</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(( a . 1) (b . 2) ( c . 3) (z . 6) (y . 77))
               (mypairlis '(a b c) '(1 2 3) '((z . 6) (y . 77)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"error"</span>
               (<span style="color: #af00ff;">handler-case</span> (mypairlis '(a b c) nil '((z . 6) (y . 77)))
                 (MYPAIRLIS-ERROR (condition) <span style="color: #87005f;">"error"</span>))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"error"</span>
               (<span style="color: #af00ff;">handler-case</span> (mypairlis nil '(1 2 3) '((z . 6) (y . 77)))
                 (MYPAIRLIS-ERROR (condition) <span style="color: #87005f;">"error"</span>))))
</pre>
</div>

<p>
Теперь нам понадобится новая функция <code>evlet</code>. Она рекурсивно вычисляет <code>exps</code>
перебрасывая вычисленные результаты в <code>evald-exps</code> и по окончании этого процесса
вызывает <code>evprogn</code> чтобы вычислить тело <code>let</code> в объединенном окружении.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_evlet_4">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evlet</span> (vars exps evald-exps exp env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null exps)  (evprogn exp
                               (pairlis vars (reverse evald-exps) env)
                               errcont cont))
        (t            (myeval (car exps) env errcont
                              (<span style="color: #af00ff;">lambda</span> (x)
                                (evlet vars (cdr exps) (cons x evald-exps) exp env errcont cont))))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_evlet_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; EVLET</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (evlet '(a b) '(1 2) nil '(4 (+ a b)) nil #'err #'ok)))
</pre>
</div>


<p>
используем <code>evlet</code> в <code>myeval</code> чтобы вычислить <code>let</code>
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_let_4">((equal (car exp) 'let)      (evlet (mapcar #'car (cadr exp))
                                    (mapcar #'cadr (cadr exp))
                                    nil
                                    (cddr exp)
                                    env
                                    errcont
                                    cont))
</pre>
</div>

<p>
Протестируем <code>let</code> и <code>evlet</code>
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_let_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; LET</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 2) (myeval '(<span style="color: #af00ff;">let</span> ((a 1)
                                       (b 2))
                                  (cons a b)) nil
                                  #'err #'ok)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-28" class="outline-3">
<h3 id="unnumbered-28">LET*</h3>
<div class="outline-text-3" id="text-unnumbered-28">
<p>
cps
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_evletstar_4">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evletstar</span> (varpairs exp env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null varpairs)  (evprogn exp env errcont cont))
        (t                (myeval (cadar varpairs) env errcont
                                  (<span style="color: #af00ff;">lambda</span> (x)
                                    (evletstar (cdr varpairs) exp
                                               (acons (caar varpairs) x env)
                                               errcont cont))))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_evletstar_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; EVLETSTAR</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (evletstar '((a 1) (b a)) '(4 (+ a b)) nil  #'err #'ok)))
</pre>
</div>


<p>
cps
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_letstar_4">((equal (car exp) 'let*)     (evletstar (cadr exp)
                                        (cddr exp)
                                        env
                                        errcont cont))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_letstar_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; LET*</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 1 . 2) (myeval '(<span style="color: #af00ff;">let*</span> ((a 1)
                                          (b 2)
                                          (c (+ a b)))
                                    (cons c (cons a b)))
                                  nil #'err #'ok)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-29" class="outline-3">
<h3 id="unnumbered-29">DEFUN</h3>
<div class="outline-text-3" id="text-unnumbered-29">
<p>
При создании функции мы создаем замыкание, в которое кладем тело функции, текущее
окружение и аргументы функции. Здесь меняется только то, что после этого мы вызываем
продолжение <code>cont</code>.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_defun_4">((equal (car exp) 'defun)         (<span style="color: #af00ff;">progn</span>
                                    (push (cons (cadr exp)
                                                (make-closure <span style="color: #5f5f87;">:body</span> (cadddr exp)
                                                              <span style="color: #5f5f87;">:env</span> env
                                                              <span style="color: #5f5f87;">:args</span> (caddr exp)))
                                          *glob-env*)
                                    (funcall cont (cadr exp))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_defun_4_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; DEFUN</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 64 (<span style="color: #af00ff;">progn</span>
                    (setf *glob-env* nil)
                    (myeval '(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">alfa</span> (x) (* x x)) nil #'err #'ok)
                    (<span style="color: #af00ff;">prog1</span> (myeval '(alfa 8) nil #'err #'ok)
                      (setf *glob-env* nil)))))
</pre>
</div>
</div>
</div>
